<p align="center" >
<a href="https://www.wdc.ng/">
<img src='https://images.yalwa.com.ng/Wild-Fusion-Digital-Centre/vap_1019131596.png'>
</a>
</p>

### Pandas Series Exercise

In [1]:
import pandas as pd

In [2]:
labels = ['a','b','c','d','e']
data = [10, 20, 30, 40, 50]
data_dict = {'A': 10, 'B': 20, 'C': 30, 'D': 40, 'E': 50}

In [10]:
ho=pd.Series(data_dict)

In [11]:
ho

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [23]:
print(ho['C'])
print(ho['D'])

30
40

In [5]:
Ser = pd.Series(data,labels)
Ser

a    10
b    20
c    30
d    40
e    50
dtype: int64

### Pandas DataFrame Exercise

In [24]:
data2 = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

In [29]:
by=pd.DataFrame(data2)
by

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [31]:
print(by['City'])

0         New York
1    San Francisco
2      Los Angeles
Name: City, dtype: object

In [34]:
by['lastname']=['Johnson','Marculey','Binlarden']
by

      Name  Age           City   lastname
0    Alice   25       New York    Johnson
1      Bob   30  San Francisco   Marculey
2  Charlie   35    Los Angeles  Binlarden

In [49]:
by['City']=='San Francisco'

0    False
1     True
2    False
Name: City, dtype: bool

In [50]:
by[(by['City']=='San Francisco')]

  Name  Age           City  lastname
1  Bob   30  San Francisco  Marculey

### Pandas Groupby Exercise

In [58]:
data3 = {'Region': ['North', 'North', 'South', 'South', 'East'],
        'Category': ['Electronics', 'Furniture', 'Electronics', 'Furniture', 'Electronics'],
        'Sales': [1000, 800, 1200, 900, 1500],
        'Profit': [200, 100, 250, 120, 300]}
df = pd.DataFrame(data)

    0
0  10
1  20
2  30
3  40
4  50

### Joins

In [86]:
data4 = {'ID': [1, 2, 3],
         'Name': ['Alice', 'Bob', 'Charlie']}
data5 = {'ID': [2, 3, 4],
         'Age': [25, 30, 35]}

df1 = pd.DataFrame(data4)
df2 = pd.DataFrame(data5)

### Pivot Table Exercise

In [87]:
data6 = {'Category': ['A', 'A', 'A', 'B', 'A'],
        'Region': ['North', 'North', 'South', 'South', 'East'],
        'Sales': [100, 200, 150, 250, 120]}